{
  "blogs": [
    {
      "title": "My First Blog",
      "body": "Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list.",
      "author": "seun",
      "id": 1
    },
    {
      "title": "My Second Blog",
      "body": "Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list.",
      "author": "seyi",
      "id": 2
    },
    {
      "title": "hello developers, again",
      "body": "Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade. So if you think we left out anything, please let us know. On to the list. Nigerian literature in the past decade has shown an incredible growth spike. With new voices, a range of genres and topics, the books, short stories and people that make up Nigerian literature have steadily circumvented labels and stereotypes. And while there’s so much more to be done, there’s proof that Nigerian writers are doing the work. Here at Zikoko, we’ve decided to make a list to celebrate some of the novels we consider to be the best published in the last decade. Creating this list was super difficult because so many wonderful novels were published in the last decade.",
      "author": "seun",
      "id": 7
    }
  ]
}